app/Controllers/Tasks.php

SELECT *
FROM `tasks`
---
    public function index()
    {
        $model = new TasksModel();
        $data['tasks'] = $model->findAll();

SELECT COUNT(*) AS `numrows`
FROM `tasks`
---
    public function datatable()
    {
        $model = new TasksModel();

        $draw = $this->request->getVar('draw');
        $columns = ['id', 'judul', 'status']; // Kolom yang ingin ditampilkan dalam DataTables

        $totalRecords = $model->countAllResults();